In [2]:
import pandas as pd

In [8]:
data={'col1':['one','two','one','one','two','one','one','two'],'col2':[1,1,1,3,4,5,1,2]}
df1=pd.DataFrame(data)
df1

  col1  col2
0  one     1
1  two     1
2  one     1
3  one     3
4  two     4
5  one     5
6  one     1
7  two     2

In [13]:
df1.drop_duplicates().shape

(6, 2)

In [15]:
df1.drop_duplicates(['col1'])

  col1  col2
0  one     1
1  two     1

In [17]:
df1.drop_duplicates(['col2'])

  col1  col2
0  one     1
3  one     3
4  two     4
5  one     5
7  two     2

In [22]:
df1.drop_duplicates(['col1','col2'],inplace=True)

In [23]:
df1

  col1  col2
0  one     1
1  two     1
3  one     3
4  two     4
5  one     5
7  two     2